# p.92 큰 수의 법칙 ######################################################################################################

n, m, k = map(int, input().split())
nums = list(map(int, input().split()))

nums.sort()
a, b = divmod(m, k+1)

print((nums[-1]*k + nums[-2])*a + nums[-1]*b)

# p.96 숫자 카드 게임 ####################################################################################################

n, m = map(int, input().split())
cards = [sorted(list(map(int, input().split()))) for _ in range(n)]

min_nums = []

for card in cards:
    min_nums.append(card[0])

print(max(min_nums))

# p.99 1이 될 때까지 #####################################################################################################

n, k = map(int, input().split())

cnt = 0

while n != 1:
    if n % k == 0:
        n /= k
        cnt += 1
    else:
        n -= 1
        cnt += 1

print(cnt)

########################################################################################################################
